#### CircuitLoadCalculationMethod Enumeration

---

|  |
| --- |
| See Also |

Methods to calculate circuit loads

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public enum CircuitLoadCalculationMethod ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CircuitLoadCalculationMethod ``` |

| Visual C++ |
| --- |
| ``` public enum class CircuitLoadCalculationMethod ``` |

# Members

| Member name | Description |
| --- | --- |
| SumTrueLoadAndReactiveLoad | Sum true load and reactive load. |
| SumApparentLoad | Sum apparent load. |

# See Also

Autodesk.Revit.DB.Electrical Namespace